heatExchanger/diagonal_cylinders/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_fluid
    {
        type            patch;
        nFaces          35;
        startFace       28734;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          26;
        startFace       28769;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1393;
        startFace       28795;
    }
    walls_heater
    {
        type            patch;
        nFaces          208;
        startFace       30188;
    }
    base_fins
    {
        type            patch;
        nFaces          442;
        startFace       30396;
    }
)

// ************************************************************************* //
